<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\Prerequistic;
use Illuminate\Support\Carbon;

class PrerequisticSeeder extends Seeder
{
    public function run(): void
    {
        $states = [
            [
                'id'            => 1,
                'type'          => '8',
                'title'         => 'ATech Access',
                'description'   => 'ATech လျှောက်ထားရာတွင် AGTI ဒီပလိုမာလက်မှတ်ရ ဖြစ်ပါက လျှောက်ထားနိုင်ပါသည်။',
                'created_at'          => Carbon::now()->format('Y-m-d'),
            ],
            [
                'id'            => 2,
                'type'          => '3',
                'title'         => 'REC Access',
                'description'   => 'ပြည်တွင်းပြည်ပရှိ နည်းပညာတက္ကသိုလ်၊ အင်ဂျင်နီယာတက္ကသိုလ်၊ နည်းပညာကောလိပ်နှင့် နည်းပညာသိပ္ပံများ၊ အင်ဂျင်နီယာအထူးပြုပညာရပ်ဆိုင်ရာအရည်အသွေး စိစစ်အသိအမှတ် ပြုရေး လုပ်ငန်းကော်မတီက အသိအမှတ်ပြုထားသော အင်ဂျင်နီယာပညာရပ်နှင့် သက်ဆိုင်သည့်အဖွဲ့အစည်းနှင့် ဌာနတစ်ခုခုကဖြစ်စေ အပ်နှင်းသည့် ဒီပလိုမာရရှိသူများ၊ (အလုပ်သင်ကာလ ၂ နှစ် ပြည့်မြောက်ပြီး သက်ဆိုင်ရာမှတ်ပုံတင်အကြီးတန်းအင်ဂျင်နီယာ၏ ထောက်ခံစာတင်ပြရန်လိုအပ်ပါသည်။)',
                'created_at'          => Carbon::now()->format('Y-m-d'),
            ],
            [
                'id'            => 3,
                'type'          => '1',
                'title'         => 'PE Discipline',
                'description'   => 'လျှောက်ထားလိုသည့် Discipline (တစ်ခုတည်းကိုသာ) ရွေးချယ် လျှောက်ထားရန်၊',
                'created_at'          => Carbon::now()->format('Y-m-d'),
            ],
            [
                'id'            => 4,
                'type'          => '9',
                'title'         => 'ACPE Professional',
                'description'   => 'Professional Engineer Certificate ရရှိပြီး မြန်မာနိုင်ငံသားမှတ်ပုံတင်လက်မှတ် ကိုင်ဆောင်ထားသူများ',
                'created_at'          => Carbon::now()->format('Y-m-d'),
            ],
            [
                'id'            => 5,
                'type'          => '7',
                'title'         => 'AGTech ID Card',
                'description'   => 'AGTech လျှောက်ထားပြီး(၁)လပြည့်ပါက သက်ဆိုင်ရာ ID Card ထုတ်ပေးပါသည်။',
                'created_at'          => Carbon::now()->format('Y-m-d'),
            ],
            [
                'id'            => 6,
                'type'          => '6',
                'title'         => 'AEC Access',
                'description'   => 'ပြည်တွင်းပြည်ပရှိ နည်းပညာတက္ကသိုလ်၊ အင်ဂျင်နီယာတက္ကသိုလ်၊ နည်းပညာကောလိပ်နှင့် နည်းပညာသိပ္ပံများ၊ အင်ဂျင်နီယာအထူးပြု ပညာရပ်ဆိုင်ရာ အရည်အသွေး စိစစ်အသိအမှတ်ပြုရေး လုပ်ငန်းကော်မတီက အသိအမှတ်ပြုထားသော အင်ဂျင်နီယာပညာရပ်နှင့် သက်ဆိုင်သည့်အဖွဲ့အစည်းနှင့် ဌာနတစ်ခုခုကဖြစ်စေ အပ်နှင်းသည့် ဘွဲ့ရရှိသူများ၊ (BE ဘွဲ့ရရှိသူများ၊ အင်ဂျင်နီယာအထူးပြုပညာရပ်ဆိုင်ရာအရည်အသွေး စိစစ်အသိအမှတ်ပြုရေး လက်စွဲ၊ မူဝါဒသတ်မှတ်ချက်များနှင့်အညီ စိစစ်၍ ကိုက်ညီမှုရှိသည့် BE ဘွဲ့နှင့်တူညီသည့် ဘွဲ့ရရှိထားသူများ၊) ',
                'created_at'          => Carbon::now()->format('Y-m-d'),
            ],
            [
                'id'            => 7,
                'type'          => '2',
                'title'         => 'Registration User',
                'description'   => 'လျှောက်ထားသူ၏အမည်ကို မြန်မာ၊ အင်္ဂလိပ်နှစ်ဘာသာဖြင့် ဖော်ပြရန်၊ (ဘွဲ့လက်မှတ်နှင့် တိုက်ဆိုင်စစ်ဆေးမည်ဖြစ်ပါသဖြင့် ဘွဲ့လက်မှတ်တွင် ဖော်ပြထားသည့်အမည်နှင့် တူညီစွာ မြန်မာ၊ အင်္ဂလိပ်ဘာသာဖြင့် ရေးသားဖော်ပြ လျှောက်ထားရန် လိုအပ်ပါသည်။)',
                'created_at'          => Carbon::now()->format('Y-m-d'),
            ],
            [
                'id'            => 8,
                'type'          => '4',
                'title'         => 'Registration User',
                'description'   => 'လျှောက်ထားသူ၏အမည်ကို မြန်မာ၊ အင်္ဂလိပ်နှစ်ဘာသာဖြင့် ဖော်ပြရန်၊ (ဘွဲ့လက်မှတ်နှင့် တိုက်ဆိုင်စစ်ဆေးမည်ဖြစ်ပါသဖြင့် ဘွဲ့လက်မှတ်တွင် ဖော်ပြထားသည့်အမည်နှင့် တူညီစွာ မြန်မာ၊ အင်္ဂလိပ်ဘာသာဖြင့် ရေးသားဖော်ပြ လျှောက်ထားရန် လိုအပ်ပါသည်။)',
                'created_at'          => Carbon::now()->format('Y-m-d'),
            ],
            [
                'id'            => 9,
                'type'          => '5',
                'title'         => 'Registration User',
                'description'   => 'လျှောက်ထားသူ၏အမည်ကို မြန်မာ၊ အင်္ဂလိပ်နှစ်ဘာသာဖြင့် ဖော်ပြရန်၊ (ဘွဲ့လက်မှတ်နှင့် တိုက်ဆိုင်စစ်ဆေးမည်ဖြစ်ပါသဖြင့် ဘွဲ့လက်မှတ်တွင် ဖော်ပြထားသည့်အမည်နှင့် တူညီစွာ မြန်မာ၊ အင်္ဂလိပ်ဘာသာဖြင့် ရေးသားဖော်ပြ လျှောက်ထားရန် လိုအပ်ပါသည်။)',
                'created_at'          => Carbon::now()->format('Y-m-d'),
            ],
            [
                'id'            => 10,
                'type'          => '6',
                'title'         => 'Registration User',
                'description'   => 'လျှောက်ထားသူ၏အမည်ကို မြန်မာ၊ အင်္ဂလိပ်နှစ်ဘာသာဖြင့် ဖော်ပြရန်၊ (ဘွဲ့လက်မှတ်နှင့် တိုက်ဆိုင်စစ်ဆေးမည်ဖြစ်ပါသဖြင့် ဘွဲ့လက်မှတ်တွင် ဖော်ပြထားသည့်အမည်နှင့် တူညီစွာ မြန်မာ၊ အင်္ဂလိပ်ဘာသာဖြင့် ရေးသားဖော်ပြ လျှောက်ထားရန် လိုအပ်ပါသည်။)',
                'created_at'          => Carbon::now()->format('Y-m-d'),
            ],
            [
                'id'            => 11,
                'type'          => '10',
                'title'         => 'Registration User',
                'description'   => 'လျှောက်ထားသူ၏အမည်ကို မြန်မာ၊ အင်္ဂလိပ်နှစ်ဘာသာဖြင့် ဖော်ပြရန်၊ (ဘွဲ့လက်မှတ်နှင့် တိုက်ဆိုင်စစ်ဆေးမည်ဖြစ်ပါသဖြင့် ဘွဲ့လက်မှတ်တွင် ဖော်ပြထားသည့်အမည်နှင့် တူညီစွာ မြန်မာ၊ အင်္ဂလိပ်ဘာသာဖြင့် ရေးသားဖော်ပြ လျှောက်ထားရန် လိုအပ်ပါသည်။)',
                'created_at'          => Carbon::now()->format('Y-m-d'),
            ],
            [
                'id'            => 12,
                'type'          => '12',
                'title'         => 'Registration User',
                'description'   => 'လျှောက်ထားသူ၏အမည်ကို မြန်မာ၊ အင်္ဂလိပ်နှစ်ဘာသာဖြင့် ဖော်ပြရန်၊ (ဘွဲ့လက်မှတ်နှင့် တိုက်ဆိုင်စစ်ဆေးမည်ဖြစ်ပါသဖြင့် ဘွဲ့လက်မှတ်တွင် ဖော်ပြထားသည့်အမည်နှင့် တူညီစွာ မြန်မာ၊ အင်္ဂလိပ်ဘာသာဖြင့် ရေးသားဖော်ပြ လျှောက်ထားရန် လိုအပ်ပါသည်။)',
                'created_at'          => Carbon::now()->format('Y-m-d'),
            ],
            [
                'id'            => 13,
                'type'          => '11',
                'title'         => 'Registration User',
                'description'   => 'လျှောက်ထားသူ၏အမည်ကို မြန်မာ၊ အင်္ဂလိပ်နှစ်ဘာသာဖြင့် ဖော်ပြရန်၊ (ဘွဲ့လက်မှတ်နှင့် တိုက်ဆိုင်စစ်ဆေးမည်ဖြစ်ပါသဖြင့် ဘွဲ့လက်မှတ်တွင် ဖော်ပြထားသည့်အမည်နှင့် တူညီစွာ မြန်မာ၊ အင်္ဂလိပ်ဘာသာဖြင့် ရေးသားဖော်ပြ လျှောက်ထားရန် လိုအပ်ပါသည်။)',
                'created_at'          => Carbon::now()->format('Y-m-d'),
            ],
        ];
        Prerequistic::insert($states);
    }
}
